[
    "Nardwuar real name is John Ruskin",
    "Nardwuar is Canadian",
    "Nardwuar is the lead singer and keyboardist for the Evaporators", 
    "Nardwuar got his start in media at the University of British Columbia radio station CITR 101.9 FM in Vancouver.",
    "Nardwuar was born in 1968", 
    "Nardwuar\"s show has been running every Friday afternoon since October 1987.",
    "Nardwuar\"s interviews have frequently been shown on MuchMusic\"s Going Coastal, or printed in Chart.", 
    "Nardwuar sometimes appears as a guest host and interviewer on CBC Radio 3 and started his own weekly program on freeform radio station WFMU which ran from 2009 to 2013.",
    "Nardwuar\"s father, Vernon, was an engineer and his mother Olga Ruskin was a local journalist, high school history teacher and historian", 
    "Nardwuar published a history of Vancouver historical figure 'Gassy Jack' John Deighton.",
    "Nardwuar\"s mother exposed him to local history by bringing him to historical society meetups.",
    "In elementary school, Nardwuar won a public speaking competition and was a long-distance runner.",
    " Nardwuar attended Hillside Secondary School in West Vancouver, where he was a member of the student council.",
    "Nardwuar was accepted into the University of British Columbia in 1986, the same year he changed his name to Nardwuar.",
    "Nardwuar graduated in 1990 with a bachelor\"s degree in history.",
    "Nardwuar has been known to be a guerrilla journalist often sneaking into press conferences under the guise of an orthodox reporter to confront political leaders or other non-musical celebrities with surreal or confusing questions.",
    "In June 2004, Nardwuar convinced an amused Paul Martin, former Prime Minister of Canada, to play a quick game of the Hasbro game Hip Flip while he was on the campaign trail.",
    "Nardwuar was escorted out by Harper\"s security while trying to initiate the game.",
    "In 2019, Nardwuar was inducted into the BC Entertainment Hall of Fame and included in their star walk on Granville Street in Downtown Vancouver.",
    "On July 10,1999, Nardwuar suffered seizures and temporary paralysis resulting from a cerebral hemorrhage, but he quickly recovered.",
    "On December 6,2015, Nardwuar suffered a stroke and was released from hospital six days later.",
    "On January 25,2016, Nardwuar underwent surgical repair of a patent foramen ovale, a hole between two chambers of the heart, which was the likely cause of his stroke." ,  
    "In 1991, Lee Ranaldo and Thurston Moore smashed a seven-inch record Nardwuar had brought as a gift and wrenched his shirt over his head while he shouted in distress: You idiot!"
]